[Killed] OptionalChaining
main/components/Nav/AppNavbar.js:8:20
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
   
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = systemInfo.oauthLogin || "/oauth2/authorization/google";
   return (
     <>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'oauthLogin')
